Autodesk.Revit.DB.Family.LoadFamilyX(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.IDictionary{System.String,System.String},System.Collections.Generic.IDictionary{System.String,System.String}@)
Loads a family. Displays the standard Revit dialogs when overwriting a family. If a
text type catalog is found, displays the standard dialog for family type selection.
document:
The document to load the family into.
filename:
The file from which to load the family.
extraJournalDataOut:
Data that can be used for journal replay. Ignorable. Both In and Out ExtJournalData objects can be the same thing.
Returns:
True if the family was loaded successfully, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Family.CanLoadFamilies(Autodesk.Revit.DB.Document)
Checks whether the document is in a state that allows the loading of families.
document:
The document to check.
Returns:
True if loading of families is allowed, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Family.GetFamilyTypeParameterValues(Autodesk.Revit.DB.ElementId)
Returns all applicable values for a FamilyType parameter of this family.
Remarks:
The values are Element Ids of all family types that match
the category specified by the definition of the given parameter.
The elements are either of class Autodesk.Revit.DB.ElementType or
Autodesk.Revit.DB.NestedFamilyTypeReference. The second variant is
for the types that are nested in families and thus are not
accessible otherwise.
If there are no applicable types of such category the returned
collection will be empty.
parameterId:
A valid Id of a FamilyType parameter defined for this family.
Returns:
Ids of all applicable Autodesk.Revit.DB.ElementType and Autodesk.Revit.DB.NestedFamilyTypeReference elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given parameterId does not represent a valid FamilyType parameter of this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Family.IsAppropriateCategoryId(Autodesk.Revit.DB.ElementId)
Identifies if the input category id can be assigned as the new category for this family.
categoryId:
The category id.
Returns:
True if the input category id can be assigned as the new category for this family, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Family.FamilyCategoryId
The id of the category or sub category in which the elements that this family could generate reside.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input category id cannot be assigned as the new category for this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The family is not an owner family for its own editable document.
Since:
2015

Autodesk.Revit.DB.Family.StructuralCodeName
The family's structural code name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Family.StructuralFamilyNameKey
The family's structural section shape name key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016